Source/ProductSearch/examples/FindProductsByNameRequest.xml

<!--This is an example to test the Find Products By Name Request-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				xmlns:gs="http://spring.io/guides/gs-producing-web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:findProductsByNameRequest>
            <gs:productName>Viaje</gs:productName>
        </gs:findProductsByNameRequest>
    </soapenv:Body>
</soapenv:Envelope>